package com.ourteam.animal_shelter.constants;

/**
 * @author Ilya Boriskin
 * The Class contains constants
 */
public class Constants {
    /**
     * Константа приветствия
     */
    public static String MEET = "Привет! Я телеграм бот, Петя! Я взаимодействую с приютами и помогаю найти дом для собак.";
    /**
     * Информация о приюте
     */
    public static String INFO_SHELTER = "Наш приют был основан в феврале 2019 года. За первый год мы сменили несколько локаций. С 2020 года мы базируемся здесь. Если раньше помещения не были адаптированы, то здесь подход был принципиально иным. Все было создано для животных, поэтому для них было комфортно";
    /**
     * График работы
     */
    public static String SHEDULE = "Наш приют работает ежедневно с 9 до 20 часов";
    /**
     * Контакты для закзаза пропуска
     */
    public static String GUARD_CONTACTS = " Для заказа пропуска свяжитесь с охраной по телефону 235-56-54";
    /**
     * Правила нахождения в приюте
     */
    public static String RULES = "После входа и выхода из вольеров тщательно следите, чтобы двери были хорошо закрыты на щеколду.\n" +
            "\n" +
            "Перед прогулкой с собакой за территорией приюта проверьте целостность поводка, надёжность карабина, насколько туго затянут ошейник.\n" +
            "\n" +
            "Для угощения собак можно приносить только специальные собачьи лакомства.\n" +
            "\n" +
            "Перед тем, как взять на прогулку новую (незнакомую) собаку, спросите у старших волонтеров или работников, можно ли с ней гулять.\n" +
            "\n" +
            "Если у вас есть свои домашние питомцы и они случайно заболели, воздержитесь от приезда в приют.\n" +
            "\n" +
            "Перед началом проведения работ уточните у руководства, какие дела запланированы на сегодня.\n" +
            "\n" +
            "Если планируете помочь с уборкой, выгулом собак и делами по хозяйству, нужно брать с собой сменную одежду.\n" +
            "\n" +
            "Не заходите без опытных сопровождающих в вольеры с незнакомыми собаками.\n" +
            "\n" +
            "По территории приюта передвигайтесь спокойно, не бегайте, не машите руками, говорите спокойно.\n" +
            "\n" +
            "Если при вас собаки начали драку, не лезьте голыми руками их разнимать. Сразу зовите на помощь! Вам помогут опытные волонтеры или работники.";
    public static String PHONE_VOLUNTEER = " Для связи с волонтером позвоните по телефону +7-900-100-20-10";

}
